{
  "backend/main.mo": "Main Motoko actor for the ICP backend implementing user authentication (sessions, password hashing), role-based access control (Master/Staff/Client), file metadata management, and chunked blob storage with share tokens.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (pipelined chunked upload, frontend caching layer, streaming download) to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key changes of components, hooks, pages, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark themes, including sidebar, chart, and semantic UI colors.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'LuidFiles', mounting the app at the #root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (landing, login, register, dashboard, admin, share), including auth guards and wrapper components that inject session tokens into page components.",
  "frontend/src/components/ChunkedUpload.tsx": "Upload UI component supporting drag-and-drop or file picker, displaying a shadcn Progress bar with per-chunk percentage, estimated time remaining via a Clock icon, and Portuguese-language labels; delegates upload logic to the useChunkedUpload hook.",
  "frontend/src/components/FileList.tsx": "Renders a list of uploaded files with actions for download, share-link generation, and deletion, including per-file progress bars and clipboard copy feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides simple localStorage helpers to get, set, and clear a session token, plus an isAuthenticated check.",
  "frontend/src/hooks/useChunkedUpload.ts": "Implements a chunked file upload hook that splits files into 2 MB pieces, uploads up to 3 chunks concurrently, tracks progress with ETA, and supports cancellation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flow, and persisting the delegated identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for auth (login, logout, register, session validation) and file operations (list, delete, share link, storage stats) against the ICP backend actor.",
  "frontend/src/hooks/useStreamingDownload.ts": "Handles file downloads by calling the backend's downloadFile endpoint, caching the resulting blob for instant repeat downloads, and providing simulated progress feedback during the single-call fetch.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Space Grotesk fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for the LuidCorporation white-and-neon-green brand theme (light and dark), and adds utility classes and keyframe animations for neon glow, glass, fade, slide, and float effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider (React Query), InternetIdentityProvider, and the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page allowing Master/Staff users to list, create, delete, and update users (GB limit and role), and view a per-user storage usage profile via a ClientProfile sub-component.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated user dashboard that displays the user's file list, storage usage stats, and a chunked-upload panel, with sessionStorage-based caching of file metadata for instant rendering on load.",
  "frontend/src/pages/LandingPage.tsx": "Public marketing landing page for LuidFiles featuring an animated hero section, intersection-observer-driven scroll animations, a features grid, and a plans section, with navigation to login and register routes.",
  "frontend/src/pages/LoginPage.tsx": "Login page with a username/password form that calls the backend actor's login method, stores the session token, and redirects to the dashboard on success, styled with a dark neon-green theme.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page component that collects username, password, and confirmation, validates inputs, calls the actor to register and log in the user, then redirects to the dashboard. Includes password strength indicator and error handling.",
  "frontend/src/pages/SharePage.tsx": "Public share page that resolves a share token (with optional fileId prefix) to file metadata via the actor, then allows the visitor to download the file using the streaming download hook with progress display.",
  "frontend/src/utils/chunkCache.ts": "Provides an in-memory Map cache for downloaded file chunks keyed by fileId+chunkIndex, plus sessionStorage helpers to persist and load file metadata across page navigations.",
  "frontend/src/utils/fileIcons.ts": "Maps MIME types to Lucide icon components, colors, and labels, and exports utility functions for formatting file sizes and converting ICP nanosecond timestamps to human-readable dates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Inter, Space Grotesk), an oklch-based color palette with neon accent tokens, neon glow box-shadows, and keyframe animations for accordion, fade-in, slide-up, and neon pulse effects.",
  "project_state.json": "Project state manifest tracking the LuidFiles/Caffeine ICP file storage platform's architecture notes, known issues, completed features (chunked upload pipelining, frontend caching, streaming download), and pending feature requests (Stable Memory, Asset Canister, cache improvements)."
}